installing-guix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-30 Wed 16:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Configuring a Guix Install</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tanner Hoelzel" />
</head>
<body>
<div id="content">
<h1 class="title">Configuring a Guix Install</h1>

<div id="outline-container-orgf764240" class="outline-2">
<h2 id="orgf764240">Guix suggestions</h2>
<div class="outline-text-2" id="text-orgf764240">
</div>
<div id="outline-container-org3c2cf57" class="outline-3">
<h3 id="org3c2cf57">System generations</h3>
<div class="outline-text-3" id="text-org3c2cf57">
<ul class="org-ul">
<li>A tree of derivations would be cool, rather than a single
list. Also, better naming in the bootloader would be awesome. Maybe
you can name an operating system?</li>
<li><kbd>operating-system</kbd> fields that allows specifying the number of build
users</li>
<li>Installing guix as an unprivileged user sounds really cool, but
requires "&#x2013;disable-chroot" which sounds like it defeats a lot of
the benefits of guix</li>
<li><p>
Why does guix need several different invocations:
</p>
<ul class="org-ul">
<li><kbd>guix pull</kbd> manipulates one specific package, <kbd>guix</kbd></li>
<li><kbd>guix package</kbd> manipulates other packages</li>
<li><kbd>guix system</kbd> manipulates the system</li>
</ul>
<p>
Can these things all be reduced to a single invocation, <kbd>guix</kbd>? I
guess they already are&#x2026;
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgeccc046" class="outline-2">
<h2 id="orgeccc046">How it all connects</h2>
<div class="outline-text-2" id="text-orgeccc046">
<p>
At build:
</p>
<ul class="org-ul">
<li>The emacs-exwm package writes a <kbd>.desktop</kbd> file to
<kbd>/run/current-system/profile/share/xsessions</kbd> (for xinitrc to find
later)</li>
<li>The location of the default xinitrc is chosen with the following
priority: <kbd>~/.xsession</kbd>, a fallback xsession (passed by the display
manager), a user-specific <kbd>.desktop</kbd> file, or a system-wide
<kbd>.desktop</kbd> file</li>
<li>The display manager service is built as an extension to the shepherd
service, possible with a custom xinitrc</li>
</ul>

<p>
At boot:
</p>
<ul class="org-ul">
<li>Shepherd starts the login manager</li>
<li>The login manager initializes/starts the X server based on how it
extends <kbd>shepherd-root-service-type</kbd></li>
</ul>
</div>
</div>

<div id="outline-container-org998b28a" class="outline-2">
<h2 id="org998b28a">Emacs as a service</h2>
<div class="outline-text-2" id="text-org998b28a">
<p>
<a href="https://www.emacswiki.org/emacs/EmacsAsDaemon">https://www.emacswiki.org/emacs/EmacsAsDaemon</a>
<a href="https://nixos.org/manual/nixos/stable/index.html#module-services-emacs-enabling">https://nixos.org/manual/nixos/stable/index.html#module-services-emacs-enabling</a>
</p>
</div>
</div>

<div id="outline-container-org8a3b146" class="outline-2">
<h2 id="org8a3b146">Starting and Configuring X</h2>
<div class="outline-text-2" id="text-org8a3b146">
<p>
In Guix, there are a few ways to start and configure X. The Guix
<a href="https://guix.gnu.org/manual/en/html_node/X-Window.html">manual</a> claims:
</p>

<blockquote>
<p>
Note that there is no xorg-service procedure. Instead, the X server is
started by the login manager, by default the GNOME Display Manager
(GDM).
</p>
</blockquote>

<p>
But <a href="https://git.savannah.gnu.org/cgit/guix.git/tree/gnu/services/xorg.scm"><kbd>gnu/services/xorg.scm</kbd></a> exports <kbd>xorg-server-service-type</kbd>, so it
may be possible to install X as a service without a login manager.
</p>

<p>
If you do start X via a login manager service, you'll probably have
two ways to configure the startup of X. First is an
<kbd>xorg-configuration</kbd> field which can pass command line arguments to
the X Server, append to the X server configuration file (<kbd>xorg.conf</kbd>),
and more. Second is an <kbd>xsessions</kbd> field (for <kbd>gdm-configuration</kbd> it's
<kbd>xsession</kbd>; for <kbd>sddm-configuration</kbd> it's <kbd>xsession-command</kbd>) that is
a script to run before starting an X session.
</p>

<p>
It should be possible to edit the <kbd>xorg-configuration</kbd> record using
the <kbd>(config (inherit another-config) (field value))</kbd> syntax
documented in <a href="https://git.savannah.gnu.org/cgit/guix.git/tree/guix/records.scm"><kbd>guix/records.scm</kbd></a>, but I couldn't get it to work. So
once again, we'll do what the documentation says and use
<kbd>set-xorg-configuration</kbd>.  When we try
</p>
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>

<p>
Compilation will fail with "xorg-server provided more than once." It
turns out you must use the second argument to
<kbd>set-xorg-configuration</kbd>, which is documented, but not used in the
examples:
</p>
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>

<p>
You could also just install X as a user package. Perhaps there would
be a way of logging in automatically (non-interactively on a TTY?) and
then executing X as part of the login shell.
</p>
</div>
</div>

<div id="outline-container-orgd21df52" class="outline-2">
<h2 id="orgd21df52">Multiple Monitors</h2>
<div class="outline-text-2" id="text-orgd21df52">
<p>
There are several ways to use multiple monitors with X: editing the X
org configuration directly, using <kbd>xrandr</kbd>, or ~
</p>

<p>
The log file can be in different places. See <kbd>/var/log/Xorg.0.log</kbd> sor
<kbd>slim</kbd>, or <kbd>/var/log/gdm/greeter.log</kbd> for <kbd>gdm</kbd>.
</p>
</div>

<div id="outline-container-org9554219" class="outline-3">
<h3 id="org9554219">Xorg.conf(5)</h3>
<div class="outline-text-3" id="text-org9554219">
<p>
Editing <kbd>xorg.conf</kbd> is annoying to debug (errors crash X on startup,
stranding you in a TTY) but configures your monitors earliest in the X
startup process. The configuration manual can be found <a href="https://www.x.org/releases/X11R7.7/doc/man/man5/xorg.conf.5.xhtml#heading10">here</a>, <a href="https://www.x.org/archive/X11R6.8.0/doc/xorg.conf.5.html">here</a>, or
with <kbd>man 5 xorg.conf</kbd>. The location of the existing <kbd>xorg.conf</kbd> can
be found in <kbd>/var/log/Xorg.1.log</kbd>.
</p>

<p>
A default <kbd>xorg-configuration</kbd> will put a few items in <kbd>xorg.conf</kbd> <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>,
but probably none of the fields you'll want to customize: <kbd>Device</kbd>,
<kbd>Monitor</kbd>, and <kbd>Screen</kbd>.
</p>

<p>
Note: a device <kbd>Identifier</kbd> is just a name <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> that you choose for the
device; however, if you have multiple graphics cards then you can
disambiguate them with the <kbd>BusID</kbd> field. See <a href="https://unix.stackexchange.com/questions/585910/setting-busid-in-xorg-conf">stackexchange</a>.
</p>

<p>
What eventually worked for me was:
</p>
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>

<p>
Also see the <a href="https://wiki.gentoo.org/wiki/Xorg/Multiple_monitors">Gentoo wiki</a>, <a href="https://wiki.archlinux.org/title/multihead">Arch wiki</a>, or the <a href="https://wiki.ubuntu.com/X/Config">Ubuntu wiki</a>.
</p>
</div>
</div>

<div id="outline-container-orgaab7c13" class="outline-3">
<h3 id="orgaab7c13">Initialization scripts: .xsession, .xinitrc, &#x2026;</h3>
<div class="outline-text-3" id="text-orgaab7c13">
<p>
Various scripts may get called in the process of starting the
xserver. Some of the login-manager services provide a way of invoking
scripts as the xserver starts. For example, <kbd>gdm-configuration</kbd> offers
<kbd>xsession</kbd>, which is pretty much undocumented. Its default is
<kbd>xinitrc</kbd>, which we can find in the <a href="https://git.savannah.gnu.org/cgit/guix.git/tree/gnu/services/xorg.scm">source</a>. It would be necessary to
find the location of the fallback file to build from; a <kbd>.xsession</kbd>
with nothing but a call to <kbd>xrandr</kbd> immediately to the display manager
after login.
</p>
</div>
</div>

<div id="outline-container-org5f64910" class="outline-3">
<h3 id="org5f64910">Window Manager</h3>
<div class="outline-text-3" id="text-org5f64910">
<p>
You can simply invoke <kbd>xrandr</kbd> at any time, or as part of your window
manager's startup. For instructions on doing this in EXWM, see this
<a href="https://www.youtube.com/watch?v=eF5NfVN411Q">System Crafters video</a>.
</p>
</div>
</div>

<div id="outline-container-org1a248fa" class="outline-3">
<h3 id="org1a248fa">Questions</h3>
<div class="outline-text-3" id="text-org1a248fa">
<ul class="org-ul">
<li>Why does <kbd>(require 'exwm)</kbd> in <kbd>init.el</kbd> break xrandr setup???</li>
<li>What is a VESA driver? Seen in the context of an xorg modeline</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgaaaa13e" class="outline-2">
<h2 id="orgaaaa13e">Nonfree components</h2>
</div>

<div id="outline-container-orgef838ea" class="outline-2">
<h2 id="orgef838ea">Changing the default display manager in <kbd>%desktop-services</kbd></h2>
<div class="outline-text-2" id="text-orgef838ea">
</div>
<div id="outline-container-orgff9e4cb" class="outline-3">
<h3 id="orgff9e4cb"><a href="https://guix.gnu.org/manual/en/guix.html#index-slim_002dservice_002dtype">https://guix.gnu.org/manual/en/guix.html#index-slim_002dservice_002dtype</a></h3>
</div>
</div>

<div id="outline-container-org6659c33" class="outline-2">
<h2 id="org6659c33">RICEing</h2>
<div class="outline-text-2" id="text-org6659c33">
</div>
<div id="outline-container-orgdb4ddbe" class="outline-3">
<h3 id="orgdb4ddbe">Font</h3>
<div class="outline-text-3" id="text-orgdb4ddbe">
</div>
<div id="outline-container-org4626fb8" class="outline-4">
<h4 id="org4626fb8"><a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Fonts.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/Fonts.html</a></h4>
</div>
<div id="outline-container-orge2d7379" class="outline-4">
<h4 id="orge2d7379"><a href="https://guix.gnu.org/manual/en/html_node/Fonts.html">https://guix.gnu.org/manual/en/html_node/Fonts.html</a></h4>
</div>
<div id="outline-container-org72ead35" class="outline-4">
<h4 id="org72ead35"><a href="https://unix.stackexchange.com/questions/628932/install-fonts-in-guix-system">https://unix.stackexchange.com/questions/628932/install-fonts-in-guix-system</a></h4>
</div>
<div id="outline-container-org25b8219" class="outline-4">
<h4 id="org25b8219">Finding fonts that you saw in a pdf that you liked</h4>
<div class="outline-text-4" id="text-org25b8219">
<p>
Found in <a href="https://guix.gnu.org/guix-fosdem-composing-services-20170205.pdf">Composing Guix Services</a>. Used <kbd>evince</kbd> to inspect
properties. Found lots of fonts with a similar prefix/suffix:
</p>
<ul class="org-ul">
<li>CMTT10</li>
<li>CMR10</li>
<li>CMSLTT10</li>
<li>CMTT12</li>
<li>CMSY6</li>
<li>CMTT8</li>
</ul>
</div>
</div>
<div id="outline-container-org837c6a6" class="outline-4">
<h4 id="org837c6a6"><a href="https://guix.gnu.org/manual/en/html_node/Fonts.html">https://guix.gnu.org/manual/en/html_node/Fonts.html</a></h4>
</div>
<div id="outline-container-org92b72e4" class="outline-4">
<h4 id="org92b72e4">Favorites</h4>
<div class="outline-text-4" id="text-org92b72e4">
</div>
<ul class="org-ul">
<li><a id="org7c08515"></a>Inconsolata<br /></li>
<li><a id="org3030bc5"></a>Anonymous pro<br /></li>
<li><a id="org45a115c"></a>Source code<br /></li>
</ul>
</div>
<div id="outline-container-org7bc6549" class="outline-4">
<h4 id="org7bc6549">Xorg system wide</h4>
<div class="outline-text-4" id="text-org7bc6549">
<p>
<a href="https://unix.stackexchange.com/questions/252527/run-x11-only-apps-with-custom-font-size-and-font-style">https://unix.stackexchange.com/questions/252527/run-x11-only-apps-with-custom-font-size-and-font-style</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgcb28d7e" class="outline-3">
<h3 id="orgcb28d7e">Emacs theme</h3>
<div class="outline-text-3" id="text-orgcb28d7e">
</div>
<div id="outline-container-orgbc535f7" class="outline-4">
<h4 id="orgbc535f7"><a href="https://emacsthemes.com/themes/material-theme.html">https://emacsthemes.com/themes/material-theme.html</a></h4>
</div>
<div id="outline-container-orga984721" class="outline-4">
<h4 id="orga984721">Replace zenburn bold faces with semibold</h4>
</div>
</div>
</div>

<div id="outline-container-org4ee82df" class="outline-2">
<h2 id="org4ee82df">Adding packages</h2>
<div class="outline-text-2" id="text-org4ee82df">
</div>
<div id="outline-container-orga926c94" class="outline-3">
<h3 id="orga926c94">IRC client</h3>
</div>
<div id="outline-container-orgf708d70" class="outline-3">
<h3 id="orgf708d70">PDF Manipulator</h3>
</div>
<div id="outline-container-orga286cef" class="outline-3">
<h3 id="orga286cef">Browser</h3>
</div>
</div>

<div id="outline-container-orgeba7173" class="outline-2">
<h2 id="orgeba7173">Adding services</h2>
</div>

<div id="outline-container-orge21b2d7" class="outline-2">
<h2 id="orge21b2d7">Installing more packages system-wide?</h2>
</div>
<div id="outline-container-org3ee47fa" class="outline-2">
<h2 id="org3ee47fa">Installing emacs-specific packages and hooking them up to emacs</h2>
<div class="outline-text-2" id="text-org3ee47fa">
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/emacs/comments/jhb2i6/guix_the_right_way_to_manage_your_packages/">https://www.reddit.com/r/emacs/comments/jhb2i6/guix_the_right_way_to_manage_your_packages/</a></li>
<li>Getting your emacs conf to run on multiple systems (is it even worth
it?)</li>
<li>Debugging emacs with `command-line-args`:<a href="https://emacs.stackexchange.com/questions/42021/testing-if-emacs-was-invoked-with-a-file-to-visit">https://emacs.stackexchange.com/questions/42021/testing-if-emacs-was-invoked-with-a-file-to-visit</a></li>
</ul>
</div>
</div>

<div id="outline-container-org39988bd" class="outline-2">
<h2 id="org39988bd">Getting all of our configs in one place</h2>
<div class="outline-text-2" id="text-org39988bd">
</div>
<div id="outline-container-org969edfd" class="outline-3">
<h3 id="org969edfd">config.scm</h3>
</div>
<div id="outline-container-org9184b19" class="outline-3">
<h3 id="org9184b19">Making a manifest for primary user default profile</h3>
</div>
<div id="outline-container-org21178cc" class="outline-3">
<h3 id="org21178cc">Looping in our other config files - arandr, .emacs.d, .kbd</h3>
</div>
<div id="outline-container-org495939a" class="outline-3">
<h3 id="org495939a">Separating hardware-dependent and -independent files</h3>
<div class="outline-text-3" id="text-org495939a">
</div>
<div id="outline-container-org76b395c" class="outline-4">
<h4 id="org76b395c">Hardware-dependent</h4>
<div class="outline-text-4" id="text-org76b395c">
</div>
<ul class="org-ul">
<li><a id="org34d6395"></a>Drivers<br /></li>
<li><a id="org42ac9bd"></a>.kbd file?<br /></li>
<li><a id="orga8afa95"></a>Bootloader setup<br /></li>
</ul>
</div>
<div id="outline-container-org547e4a8" class="outline-4">
<h4 id="org547e4a8">Hardware-independent</h4>
<div class="outline-text-4" id="text-org547e4a8">
</div>
<ul class="org-ul">
<li><a id="org5803cdc"></a>Everything else<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgef845ea" class="outline-2">
<h2 id="orgef845ea">Debugging kernel crashes</h2>
</div>

<div id="outline-container-org19c4823" class="outline-2">
<h2 id="org19c4823">Keybindings</h2>
</div>

<div id="outline-container-org5ac6c16" class="outline-2">
<h2 id="org5ac6c16">References</h2>
<div class="outline-text-2" id="text-org5ac6c16">
</div>
<div id="outline-container-org122e578" class="outline-3">
<h3 id="org122e578">X Server</h3>
<div class="outline-text-3" id="text-org122e578">
<ul class="org-ul">
<li>xrandr to xorg.conf example:
<a href="https://superuser.com/questions/313146/dual-monitor-setup-xrandr-versus-xorg-conf">https://superuser.com/questions/313146/dual-monitor-setup-xrandr-versus-xorg-conf</a></li>
<li>xrandr usage:
<a href="https://superuser.com/questions/1321619/xrandr-treat-multiple-screens-as-one">https://superuser.com/questions/1321619/xrandr-treat-multiple-screens-as-one</a></li>
<li>how to get modeline:
<ul class="org-ul">
<li><a href="https://askubuntu.com/questions/749358/how-to-get-correct-modeline-for-an-external-display">https://askubuntu.com/questions/749358/how-to-get-correct-modeline-for-an-external-display</a></li>
<li><a href="https://askubuntu.com/questions/943426/how-do-you-find-the-current-modeline-xrandr-is-using-for-an-output">https://askubuntu.com/questions/943426/how-do-you-find-the-current-modeline-xrandr-is-using-for-an-output</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.reddit.com/r/GUIX/comments/rxp3g3/override_settings_in_xorgconf/">https://www.reddit.com/r/GUIX/comments/rxp3g3/override_settings_in_xorgconf/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://superuser.com/questions/1014502/how-to-find-the-identifier-value-for-an-xorg-conf-device-graphics-card-secti">https://superuser.com/questions/1014502/how-to-find-the-identifier-value-for-an-xorg-conf-device-graphics-card-secti</a>
</p></div></div>


</div>
</div></div>
</body>
</html>
